FV2604/E_0615.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">6.7.1: AD: Beginn der Ersatz-/Grundversorgung</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    pad=0.25;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_0615</B><BR align="left"/><FONT>Prüfende Rolle: <B>LF</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>20: </B>Befindet sich die Marktlokation im Grundversorgungsgebiet des Empfängers oder<BR align="left"/>besteht für die Marktlokation eine vertragliche Vereinbarung zur<BR align="left"/>Ersatzbelieferung?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A02" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A02</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Keine Zuständigkeit<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>40: </B>Wurde der angefragte Geschäftsvorfall dem Anfragenden bereits zum gleichen<BR align="left"/>Zeitpunkt mit einer früheren Meldung bestätigt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A04" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A04</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Doppelmeldung<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>50: </B>Besteht eine gesetzliche oder vertragliche Pflicht zur Grund- oder<BR align="left"/>Ersatzversorgung bzw. zur Ersatzbelieferung?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A05" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A05</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>kein Grund-/Ersatzversorgungsfall bzw. Ersatzbelieferung<BR align="left"/>Der Absender lehnt die weitere Bearbeitung der Transaktion ab, da es sich um<BR align="left"/>keinen Ersatzversorgungsfall handelt und daher die Fristen und Prozessschritte<BR align="left"/>der normalen Regelprozesse eingehalten werden müssen<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "90" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>90: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A99" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A99</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.10.2026 00:00 Uhr<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "A09" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A09</B><BR align="left"/><BR align="left"/><FONT>Cluster: Zustimmung<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "20" [color="#88a0d6"];
    "20" -> "A02" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "40" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "A04" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "50" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "A05" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "90" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "90" -> "A99" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "90" -> "A09" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
